openwch/ch55x/8,CH559 U disk IAP example/CH559_U_IAP/User/ch559_UUP.C

/* 2015.10.12
****************************************
**  Copyright  (C)  W.ch  1999-2015   **
**  Web:  http://www.wch.cn  **
****************************************
*/

/* 支持: FAT32 */

/* CH559 C语言的U盘升级例程: 
1.升级文件名固定"/DOWNLOARD.BIN"
2.当前文件设定地址0xCC00，下载文件指定地址0xCB00
3.进入U盘升级程序后，P4.3口输出低电平，灯点亮；下载完成输出高电平灯灭并回到新的应用程序	
4.跟踪程序打开DEBUG_NOW宏定义即可
*/

#include <CH559.H>
#define	DEBUG_NOW
#ifdef DEBUG_NOW
#include <stdio.h>
#endif
#include "DEBUG.H"
#include "DEBUG.C"
#include <intrins.h>
// #include <string.h>

#include "CH559UFI.H"


// 各子程序返回状态码
#define	ERR_SUCCESS			0x00	// 操作成功
#define	ERR_USB_CONNECT		0x15	/* 检测到USB设备连接事件,已经连接 */
#define	ERR_USB_DISCON		0x16	/* 检测到USB设备断开事件,已经断开 */
#define	ERR_USB_BUF_OVER	0x17	/* USB传输的数据有误或者数据太多缓冲区溢出 */
#define	ERR_USB_DISK_ERR	0x1F	/* USB存储器操作失败,在初始化时可能是USB存储器不支持,在读写操作中可能是磁盘损坏或者已经断开 */
#define	ERR_USB_TRANSFER	0x20	/* NAK/STALL等更多错误码在0x20~0x2F */
#define	ERR_USB_UNSUPPORT	0xFB
#define	ERR_USB_UNKNOWN		0xFE

#define	WAIT_USB_TOUT_200US		200  // 等待USB中断超时时间200uS@Fsys=12MHz
#define	SetUsbSpeed( x )			//操作U盘设备，设为全速，正常需要选择

// 获取设备描述符
UINT8C	SetupGetDevDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_DEVICE, 0x00, 0x00, sizeof( USB_DEV_DESCR ), 0x00 };
// 获取配置描述符
UINT8C	SetupGetCfgDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_CONFIG, 0x00, 0x00, 0x04, 0x00 };
// 设置USB地址
UINT8C	SetupSetUsbAddr[] = { USB_REQ_TYP_OUT, USB_SET_ADDRESS, USB_DEVICE_ADDR, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 设置USB配置
UINT8C	SetupSetUsbConfig[] = { USB_REQ_TYP_OUT, USB_SET_CONFIGURATION, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 清除端点STALL
UINT8C	SetupClrEndpStall[] = { USB_REQ_TYP_OUT | USB_REQ_RECIP_ENDP, USB_CLEAR_FEATURE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
//获取逻辑单元数LUN
UINT8C	GetMaxLUN[] = {0xA1, 0xFE, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00};
//Mass Storage Reset
UINT8C	SetReset[] = {0xA1, 0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

UINT8X	UsbDevEndp0Size;	/* USB设备的端点0的最大包尺寸 */
UINT8X  DevEndpOUTAddr;
UINT8X  DevEndpINAddr;

//USB设备相关信息表,CH559最多支持2个设备
#define	ROOT_DEV_DISCONNECT		0
#define	ROOT_DEV_CONNECTED		1
#define	ROOT_DEV_FAILED			2
#define	ROOT_DEV_SUCCESS		3

UINT8X	RxBuffer[ MAX_PACKET_SIZE ] _at_ 0x0000 ;  // IN, must even address
UINT8X	TxBuffer[ 512 ] 			_at_ 0x0040 ;  // OUT, must even address
UINT8X	TMPDataBuf[512]       _at_ 0x0250 ; 
UINT8X	TTMPDataBuf[512]       _at_ 0x0460 ; 
#define	pSetupReq	((PXUSB_SETUP_REQ)TxBuffer)
bit		FoundNewDev;

#pragma NOAREGS

void	mDelayuS( UINT16 n );  // 以uS为单位延时
void	mDelaymS( UINT16 n );  // 以mS为单位延时

void	DisableRootHubPort( void );  // 关闭端口,实际上硬件已经自动关闭,此处只是清除一些结构状态
UINT8	AnalyzeRootHub( void );   // 分析端口状态,处理ROOT-HUB端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开
void	SetHostUsbAddr( UINT8 addr );  // 设置USB主机当前操作的USB设备地址
void	ResetRootHubPort( void );  // 检测到设备后,复位总线,为枚举设备准备,设置为默认为全速
UINT8	EnableRootHubPort( void );  // 使能端口,相应的bUH_PORT_EN置1开启端口,设备断开可能导致返回失败
UINT8	WaitUSB_Interrupt( void );  // 等待USB中断

// CH559传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
UINT8	USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout );  // endp_pid: 高4位是token_pid令牌, 低4位是端点地址
UINT8	HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen );  // 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
// 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据,实际成功收发的总长度返回保存在ReqLen指向的字节变量中
void	CopySetupReqPkg( PUINT8C pReqPkt );  // 复制控制传输的请求包

UINT8	CtrlGetDeviceDescr( void );  // 获取设备描述符,返回在TxBuffer中
UINT8	CtrlGetConfigDescr( void );  // 获取配置描述符,返回在TxBuffer中
UINT8	CtrlSetUsbAddress( UINT8 addr );  // 设置USB设备地址
UINT8	CtrlSetUsbConfig( UINT8 cfg );  // 设置USB设备配置
UINT8	CtrlClearEndpStall( UINT8 endp );  // 清除端点STALL

UINT8	InitRootDevice( void );  // 初始化USB设备

/* U盘操作命令 */
UINT8	CtrlSetUsbReset( void );  //设置U盘复位,类命令
UINT8	CtrlGetMaxLUN( void );  // 获取U盘逻辑单元数量,类命令
UINT8	CH559BulkOnlyCmd( PUINT8X DataBuf );
UINT8	CH559ReadDiskInfo(PUINT8X DataBuf );    /* 索取器件信息 */
UINT8	CH559ReadDiskCap(PUINT8X DataBuf );  	/* 索取设备容量 */
UINT8	CH559ReadOneSector(PUINT8X DataBuf, UINT32 Addr );  /* 读取1个扇区数据 */
UINT8	CH559ReadDiskDBR(PUINT8X DataBuf );     			 /* 索取设备DBR */
UINT8	CH559FileOpen( PUINT8X DataBuf );					 /* 打开文件或者枚举文件 */
UINT8	CH559ReadFile( PUINT8X DataBuf );					 /* 读取文件完整内容 */
UINT8 ComString(PUINT8 source, PUINT8 target, UINT8 l);

void IAP_ERASE(void);//擦除
void IAP_PROM( PUINT8X DataBuf, UINT16 l );//下载
void IAP_END(void);//复位

/* 为printf和getkey输入输出初始化串口 */
void	mInitSTDIO( void );
void	InitUSB_Host( void );  // 初始化USB主机


void	DisableRootHubPort( void )  // 关闭端口,实际上硬件已经自动关闭,此处只是清除一些结构状态
{
	CH559DiskStatus = DISK_DISCONNECT;
}

UINT8	AnalyzeRootHub( void )   // 分析端口状态,处理端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开
{ //处理端口的插拔事件,如果设备拔出,函数中调用DisableRootHubPort()函数,将端口关闭,插入事件,置相应端口的状态位
	UINT8	s;
	s = ERR_SUCCESS;
	if ( USB_HUB_ST & bUHS_H0_ATTACH ) {  // 设备存在
		if ( CH559DiskStatus == DISK_DISCONNECT || ( UHUB0_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 检测到有设备插入,但尚未允许,说明是刚插入
			DisableRootHubPort( );  // 关闭端口
			CH559DiskStatus = DISK_CONNECT;
#ifdef DEBUG_NOW			
			printf( "USB dev in\n" );
#endif
			s = ERR_USB_CONNECT;
		}
	}
	else if ( CH559DiskStatus >= DISK_CONNECT ) {
		DisableRootHubPort( );  // 关闭端口
#ifdef DEBUG_NOW
		printf( "USB dev out\n" );
#endif
		if ( s == ERR_SUCCESS ) s = ERR_USB_DISCON;
	}
	return( s );
}

void	SetHostUsbAddr( UINT8 addr )  // 设置USB主机当前操作的USB设备地址
{
	USB_DEV_AD = (addr&0x7F);
}

void	ResetRootHubPort( void )  // 检测到设备后,复位总线,为枚举设备准备,设置为默认为全速
{
	UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;  /* USB设备的端点0的最大包尺寸 */
	SetHostUsbAddr( 0x00 );
	SetUsbSpeed( 1 );  // 默认为全速
	UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;  // 默认为全速,开始复位
	mDelaymS( 15 );  // 复位时间10mS到20mS
	UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET;  // 结束复位
	mDelayuS( 250 );
	UIF_DETECT = 0;  // 清中断标志
}

