openwch/ch55x/8,CH559 U disk IAP example/CH559_U_IAP/User/ch559_UUP.C
	CopySetupReqPkg( SetupGetCfgDescr );
	pSetupReq -> wLengthL = len;  // 完整配置描述符的总长度
	s = HostCtrlTransfer( TxBuffer, &len );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	if ( len < ( (PUSB_SETUP_REQ)SetupGetCfgDescr ) -> wLengthL || len < ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL ) return( ERR_USB_BUF_OVER );  // 描述符长度错误
	
	CtrlSetUsbConfig(( (PXUSB_CFG_DESCR)TxBuffer ) -> bConfigurationValue);
	if((((PXUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[0].bEndpointAddress)>0x80)
	{
		DevEndpOUTAddr = (((PXUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[1].bEndpointAddress)&0x0f;
		DevEndpINAddr  = (((PXUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[0].bEndpointAddress)&0x0f;
	}
	else
	{
		DevEndpOUTAddr = (((PXUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[0].bEndpointAddress)&0x0f;
		DevEndpINAddr  = (((PXUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[1].bEndpointAddress)&0x0f;
	}

	return( ERR_SUCCESS );
}

UINT8	CtrlSetUsbAddress( UINT8 addr )  // 设置USB设备地址
{
	UINT8	s;
	CopySetupReqPkg( SetupSetUsbAddr );
	pSetupReq -> wValueL = addr;  // USB设备地址
	s = HostCtrlTransfer( NULL, NULL );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	SetHostUsbAddr( addr );  // 设置USB主机当前操作的USB设备地址
	mDelaymS( 10 );  // 等待USB设备完成操作
	return( ERR_SUCCESS );
}

UINT8	CtrlSetUsbConfig( UINT8 cfg )  // 设置USB设备配置
{
#ifdef DEBUG_NOW
	printf( "SetUsbConfig: \n" );
#endif
	CopySetupReqPkg( SetupSetUsbConfig );
	pSetupReq -> wValueL = cfg;  // USB设备配置
	return( HostCtrlTransfer( NULL, NULL ) );  // 执行控制传输
}

#if 0
UINT8	CtrlClearEndpStall( UINT8 endp )  // 清除端点STALL
{
	CopySetupReqPkg( SetupClrEndpStall );  // 清除端点的错误
	pSetupReq -> wIndexL = endp;  // 端点地址
	return( HostCtrlTransfer( NULL, NULL ) );  /* 执行控制传输 */
}
#endif

/* ************************************************************************************** */
UINT8	CtrlSetUsbReset( void )
{
	UINT8	s;
	UINT8D	len;
	
	CopySetupReqPkg( SetReset );	     		 //写入发送缓存区
	s = HostCtrlTransfer( TxBuffer, &len );      // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	if ( len < ( (PUSB_SETUP_REQ)SetReset ) -> wLengthL ) return( ERR_USB_BUF_OVER );  // 描述符长度错误
	return( ERR_SUCCESS );
}

UINT8	CtrlGetMaxLUN( void )
{
	UINT8	s;
	UINT8D	len;
	
	CopySetupReqPkg( GetMaxLUN );	     		 //写入发送缓存区
	s = HostCtrlTransfer( TxBuffer, &len );      // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	if ( len < ( (PUSB_SETUP_REQ)GetMaxLUN ) -> wLengthL ) return( ERR_USB_BUF_OVER );  // 描述符长度错误
	CH559vCurrentLun = TxBuffer[0];
	UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_T_TOG;
	return( ERR_SUCCESS );
}

/* 执行基于BulkOnly协议的命令 */
UINT8	CH559BulkOnlyCmd( PUINT8X DataBuf )
{	
	UINT8 s, i, RxLen=0;
	UINT32	RemLen;
	
	pCBW -> mCBW_Sig0 = 0x55;  
	pCBW -> mCBW_Sig1 = 0x53;
	pCBW -> mCBW_Sig2 = 0x42;
	pCBW -> mCBW_Sig3 = 0x43;
	pCBW -> mCBW_Tag0 = 0x00;  
	pCBW -> mCBW_Tag1 = 0x00;
	pCBW -> mCBW_Tag2 = 0x01;
	pCBW -> mCBW_Tag3 = 0x00;
	pCBW -> mCBW_CB_Buf[ 10 ] = 0x07;  
	pCBW -> mCBW_CB_Buf[ 11 ] = 0x05;
	pCBW -> mCBW_CB_Buf[ 12 ] = 0x81;
	pCBW -> mCBW_CB_Buf[ 13 ] = 0x02;
	pCBW -> mCBW_CB_Buf[ 14 ] = 0x40;  
	pCBW -> mCBW_CB_Buf[ 15 ] = 0x00;	
	
	UH_TX_LEN = 31;
	RemLen = (((pCBW -> mCBW_DataLen1)<<8) |pCBW -> mCBW_DataLen0);	//获取CBW与CSW直接的传输字节数
	UH_TX_CTRL ^= bUH_T_TOG;
	s = USBHostTransact( USB_PID_OUT << 4 | DevEndpOUTAddr, UH_TX_CTRL, 200000/20 );  // OUT数据  CBW
	if ( s != ERR_SUCCESS ) return( s );
	if(RemLen)		//有传输字节
	{		
		if(pCBW -> mCBW_Flag)		//获取数据，IN传输
		{
			while(RemLen)
			{
				mDelayuS( 200 );
				UH_RX_CTRL ^= bUH_R_TOG;
				s = USBHostTransact( USB_PID_IN << 4 | DevEndpINAddr, UH_RX_CTRL, 65535 );  	// IN数据
				if ( s != ERR_SUCCESS ) return( s );
				RxLen = USB_RX_LEN < RemLen ? USB_RX_LEN : RemLen; 
				RemLen -= RxLen;
				for ( i = 0; i != RxLen; i ++ ) {
					*DataBuf = RxBuffer[ i ];
					DataBuf ++;
				}
			}
		}
		else						//发送数据，OUT传输
		{
			mDelayuS( 200 );
			UH_TX_LEN = RemLen >= 64 ? 64 : RemLen;
			for ( i = 0; i != UH_TX_LEN; i ++ ) {
				TxBuffer[ i ] = *DataBuf;
				DataBuf ++;
			}
			s = USBHostTransact( USB_PID_OUT << 4 | DevEndpOUTAddr, UH_TX_CTRL, 200000/20 );   // OUT数据
			if ( s != ERR_SUCCESS ) return( s );
			RemLen -= UH_TX_LEN;
		}
	}
	
	mDelayuS( 200 );
	UH_RX_CTRL ^= bUH_R_TOG;
	s = USBHostTransact( USB_PID_IN << 4 | DevEndpINAddr, UH_RX_CTRL, 200000/20 );  			// IN数据 CSW
	if ( s != ERR_SUCCESS ) return( s );
	return (pCSW -> mCSW_Status);
}

#if 1
UINT8	CH559ReadDiskInfo(PUINT8X DataBuf )  /* 索取器件信息 */
{
	UINT8	retry, s;

	for( retry = 0; retry < 3; retry ++ ) {  /* 错误重试 */
		pCBW -> mCBW_DataLen0 = 0x24;/* 数据传输长度 */  			
		pCBW -> mCBW_DataLen1 = 0x00;
		pCBW -> mCBW_DataLen2 = 0x00;
		pCBW -> mCBW_DataLen3 = 0x00;
		pCBW -> mCBW_Flag = 0x80;			/* 上传 */
		pCBW -> mCBW_LUN = CH559vCurrentLun;
		pCBW -> mCBW_CB_Len = 0x06;
		pCBW -> mCBW_CB_Buf[ 0 ] = SPC_CMD_INQUIRY;/* 操作命令代码 */		
		pCBW -> mCBW_CB_Buf[ 1 ] = CH559vCurrentLun<<4;
		pCBW -> mCBW_CB_Buf[ 2 ] = 0x00;/* 逻辑块地址 */		
		pCBW -> mCBW_CB_Buf[ 3 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 4 ] = 0x24;
		pCBW -> mCBW_CB_Buf[ 5 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 6 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 7 ] = 0x00;/* 传输长度 */
		pCBW -> mCBW_CB_Buf[ 8 ] = 0x01;		
		pCBW -> mCBW_CB_Buf[ 9 ] = 0x00;
		s = CH559BulkOnlyCmd( DataBuf );  /* 执行基于BulkOnly协议的命令 */
		if(s == ERR_SUCCESS)	break;
	}
	return( s );  /* 磁盘操作错误 */
}
#endif

#if 0
UINT8	CH559ReadDiskCap(PUINT8X DataBuf )  /* 索取设备容量 */
{
	UINT8	retry, s;

	for( retry = 0; retry < 3; retry ++ ) {  /* 错误重试 */
		pCBW -> mCBW_DataLen0 = 0x08;/* 数据传输长度 */  			
		pCBW -> mCBW_DataLen1 = 0x00;
		pCBW -> mCBW_DataLen2 = 0x00;
		pCBW -> mCBW_DataLen3 = 0x00;
		pCBW -> mCBW_Flag = 0x80;			/* 上传 */
		pCBW -> mCBW_LUN = CH559vCurrentLun;
		pCBW -> mCBW_CB_Len = 0x0a;
		pCBW -> mCBW_CB_Buf[ 0 ] = SPC_CMD_READ_CAPACITY;/* 操作命令代码 */		
		pCBW -> mCBW_CB_Buf[ 1 ] = CH559vCurrentLun<<4;
		pCBW -> mCBW_CB_Buf[ 2 ] = 0x00;/* 逻辑块地址 */		
		pCBW -> mCBW_CB_Buf[ 3 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 4 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 5 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 6 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 7 ] = 0x00;/* 传输长度 */
		pCBW -> mCBW_CB_Buf[ 8 ] = 0x00;		
		pCBW -> mCBW_CB_Buf[ 9 ] = 0x00;
		s = CH559BulkOnlyCmd( DataBuf );  /* 执行基于BulkOnly协议的命令 */
		if(s == ERR_SUCCESS)	break;
	}
	return( s );  /* 磁盘操作错误 */
}
#endif

UINT8	CH559ReadOneSector(PUINT8X DataBuf, UINT32 Addr )  /* 读取1个扇区数据 */
{
	UINT8	retry, s;

	for( retry = 0; retry < 3; retry ++ ) {  /* 错误重试 */
		pCBW -> mCBW_DataLen0 = 0x00;/* 数据传输长度 */  			
		pCBW -> mCBW_DataLen1 = 0x02;
		pCBW -> mCBW_DataLen2 = 0x00;
		pCBW -> mCBW_DataLen3 = 0x00;
		pCBW -> mCBW_Flag = 0x80;			/* 上传 */
		pCBW -> mCBW_LUN = CH559vCurrentLun;
		pCBW -> mCBW_CB_Len = 0x0a;
		pCBW -> mCBW_CB_Buf[ 0 ] = SPC_CMD_READ10;/* 操作命令代码 */		
		pCBW -> mCBW_CB_Buf[ 1 ] = CH559vCurrentLun<<4;
		pCBW -> mCBW_CB_Buf[ 2 ] = (UINT8)(Addr>>24);/* 逻辑块地址扇区号 */		
		pCBW -> mCBW_CB_Buf[ 3 ] = (UINT8)(Addr>>16);
		pCBW -> mCBW_CB_Buf[ 4 ] = (UINT8)(Addr>>8);
		pCBW -> mCBW_CB_Buf[ 5 ] = (UINT8)Addr;
		pCBW -> mCBW_CB_Buf[ 6 ] = 0x00;
		pCBW -> mCBW_CB_Buf[ 7 ] = 0x00;/* 传输长度:1个扇区大小 */
		pCBW -> mCBW_CB_Buf[ 8 ] = 0x01;		
		pCBW -> mCBW_CB_Buf[ 9 ] = 0x00;
		s = CH559BulkOnlyCmd( DataBuf );  /* 执行基于BulkOnly协议的命令 */
		if(s == ERR_SUCCESS)	break;
	}
	return( s );  /* 磁盘操作错误 */
}

UINT8	CH559ReadDiskDBR(PUINT8X DataBuf )  /* 索取设备DBR */
{
	UINT8   s,j;
	UINT16  i,ss =0;
  j = 4;
	CH559vSecMBR = 0;
	s = CH559ReadOneSector(DataBuf, 0x00000000);
//   memcpy(TTMPDataBuf,DataBuf,512);
  while(ss < 512){
    TTMPDataBuf[ss] = DataBuf[ss];
    ss = ss +1;
  }
#ifdef DEBUG_NOW
      ss = 0;
      while(ss<512){
        if((ss%16) == 0)printf("\n");				
        printf("  %02x",(UINT16)TTMPDataBuf[ss]);
		   		ss = ss+1;
      }
#endif	
	i = 0x01BE;
	if(s == ERR_SUCCESS)	
	{
      while(j){
			CH559vSecMBR = ((UINT32)TTMPDataBuf[i+11]<<24)|((UINT32)TTMPDataBuf[i+10]<<16)|((UINT16)TTMPDataBuf[i+9]<<8)|TTMPDataBuf[i+8];  // DBR扇区号	
      if(CH559vSecMBR < 0x20000){//小于64G				
      s = CH559ReadOneSector(TMPDataBuf, CH559vSecMBR);
#ifdef DEBUG_NOW
      ss = 0;
      while(ss<512){
        if((ss%16) == 0)printf("\n");				
        printf("  %02x",(UINT16)TMPDataBuf[ss]);
					ss = ss+1;
      }
      printf("sssssssssssssssss\n");				
#endif
			if((TMPDataBuf[0x00]==0xEB)&&(TMPDataBuf[0x02]==0x90))	//DBR
		  {	
			  break;	
			}	
		  }	
      j--;			
			i+=16;					
    }	
    if(j == 0){ 
//       memcpy(DataBuf,TTMPDataBuf,512);	
      ss = 0;
			while(ss < 512){
				TTMPDataBuf[ss] = DataBuf[ss];
        ss = ss +1;
			}
      CH559vSecMBR = 0;
#ifdef DEBUG_NOW
      printf("num 0 %02x\n",(UINT16)j);				
#endif			
    }
	  else{ 
//       memcpy(DataBuf,TMPDataBuf,512);
      ss = 0;
			while(ss < 512){
				TTMPDataBuf[ss] = DataBuf[ss];
        ss = ss +1;				
			}			
#ifdef DEBUG_NOW
      printf("num n %02x\n",(UINT16)j);						
#endif	
    }
#ifdef DEBUG_NOW
      ss = 0;
      while(ss<512){
        if((ss%16) == 0)printf("\n");				
        printf("  %02x",(UINT16)DataBuf[ss]);
		   		ss = ss+1;
      }
#endif		
		CH559vSectorSizeH = DataBuf[0x0c];//扇区大小
		CH559vSecPerClus = DataBuf[0x0d]; //逻辑盘的每簇扇区数
		CH559vDiskRoot = ((UINT32)DataBuf[0x2f]<<24)|((UINT32)DataBuf[0x2e]<<16)|((UINT16)DataBuf[0x2d]<<8)|DataBuf[0x2c];//对于FAT32盘为根目录起始簇号
		CH559vSecFdt = ((UINT32)DataBuf[0x27]<<24)|((UINT32)DataBuf[0x26]<<16)|((UINT16)DataBuf[0x25]<<8)|DataBuf[0x24];  // FAT表占用扇区数
		CH559vNumFdt = DataBuf[0x10];     //FAT个数
		CH559vSecResv = ((UINT16)DataBuf[0x0F]<<8)|DataBuf[0x0E];//保留扇区数	
		CH559vDataStart	= CH559vSecMBR+CH559vSecResv+CH559vNumFdt*CH559vSecFdt;//目录项首扇区
#ifdef DEBUG_NOW
		switch(DataBuf[0x01])
		{
			case 0x3C:
				printf("It is fat16!\n");return(0xFA);//系统不对
			break;
			case 0x58:
				printf("It is fat32!\n");
			break;
			case 0x52:
				printf("It is NTFS!\n"); return(0xFA); //系统不对
			break;
			default:
				printf("system unknown! %02x  \n",(UINT16)DataBuf[0x01]);return(0xFA);//系统不对
			break;
		}
		printf("CH559vSectorSizeH: %02d \n",(UINT16)CH559vSectorSizeH);
		printf("CH559vSecPerClus: %02d \n",(UINT16)CH559vSecPerClus);
		printf("CH559vDiskRoot: %ld \n",CH559vDiskRoot);
		printf("CH559vSecFdt: %ld \n",CH559vSecFdt);
		printf("CH559vNumFdt: %02d \n",(UINT16)CH559vNumFdt);
		printf("CH559vSecResv: %02d \n",(UINT16)CH559vSecResv);
		printf("CH559vDataStart: %ld \n",CH559vDataStart);
#endif
	}
	return( s );  /* 磁盘操作错误 */
}

UINT32X	CH559ReadDiskFAT(PUINT8X DataBuf, UINT32X ClusNum)  /* 索取设备FAT表指定位置值 */
{
	UINT8   s; 
	UINT16  j=0;
	UINT32X  NextClusNum;

