openwch/ch55x/8,CH559 U disk IAP example/CH559_U_IAP/User/ch559_UUP.C
	s = CH559ReadOneSector(DataBuf, CH559vSecMBR+CH559vSecResv+(ClusNum<<2)/(CH559vSectorSizeH<<8));
	if(s == ERR_SUCCESS)
	{
		j = (ClusNum*4)%(CH559vSectorSizeH<<8);
		NextClusNum = ((UINT32)DataBuf[j+3]<<24)|((UINT32)DataBuf[j+2]<<16)|((UINT16)DataBuf[j+1]<<8)|(UINT32)DataBuf[j];
	}
	if( NextClusNum == 0x0fffffff)	return( 0 );  /* 文件已经结束于当前簇 */
	else 				  return( NextClusNum );  /* 返回下一簇号 */	

}

UINT8 ComString(PUINT8 source, PUINT8 target, UINT8 l)
{
	UINT8 i;
	for(i=0;i<l;i++)
	{
		if(*source++ != *target++)	return 1;
	}
	return 0;
}

UINT8	CH559FileOpen( PUINT8X DataBuf )
{
	UINT8	 s, j;
	UINT8	 mPathName[12] = "DOWNLOADBIN";
	UINT16   i=0;
	UINT32X	 NextClusNum, secnum;
	
	NextClusNum = CH559vDiskRoot;
	do{
		secnum = CH559vDataStart+CH559vSecPerClus*(NextClusNum-CH559vDiskRoot);//计算准备读取簇的扇区号
		
		for(j=0; j<CH559vSecPerClus; j++)				//读取一个簇的数据，查找文件
		{				
			s = CH559ReadOneSector(DataBuf,secnum+j);//读取目录项中1个扇区大小
			if(s == ERR_SUCCESS)	
			{
				i = 0;
				while(ComString(mPathName, &DataBuf[i],11)&&(i<512))
				{
					i += 32;
				}
				if(i<512)   
				{
					s = ERR_SUCCESS;
					CH559vFdtLba = (CH559vDataStart+j)*((UINT16)CH559vSectorSizeH<<8)+i;  		//文件目录项当前的逻辑地址		
					CH559vFileSize = ((UINT32)DataBuf[i+0x1f]<<24)|((UINT32)DataBuf[i+0x1e]<<16)|((UINT16)DataBuf[i+0x1d]<<8)|DataBuf[i+0x1c];	  //文件大小	
					CH559vStartCluster = ((UINT32)DataBuf[i+0x15]<<24)|((UINT32)DataBuf[i+0x14]<<16)|((UINT16)DataBuf[i+0x1b]<<8)|DataBuf[i+0x1a];//文件起始簇号				
					CH559vCurrentOffset = (CH559vDataStart+CH559vSecPerClus*(CH559vStartCluster-CH559vDiskRoot)); //文件内容当前指针扇区号
#ifdef DEBUG_NOW
					printf("CH559vFdtLba: %ld \n",CH559vFdtLba);
					printf("CH559vFileSize: %ld \n",CH559vFileSize);
					printf("CH559vStartCluster: %ld \n",CH559vStartCluster);
					printf("CH559vCurrentOffset: %ld \n",CH559vCurrentOffset);
#endif
					return( s ); 
				}
				else	s = ERR_MISS_FILE;
			}
		}
		
		NextClusNum = CH559ReadDiskFAT(DataBuf,NextClusNum);//计算下一簇号
		
#ifdef DEBUG_NOW
		printf("NextClusNum: x%lx \n",NextClusNum);
#endif
	}while(NextClusNum);
	
	return( s );  /* 磁盘操作错误 */
}

UINT8	CH559ReadFile( PUINT8X DataBuf )		/* 读取文件完整内容 */
{
	UINT8	 s, j;
	UINT16   len;
	UINT32X	 NextClusNum, secnum, resvsize;
	
	NextClusNum = CH559vStartCluster;	
	resvsize = CH559vFileSize;
	do{
		secnum = CH559vDataStart+CH559vSecPerClus*(NextClusNum-CH559vDiskRoot);//计算准备读取簇的扇区号
		for(j=0; j<CH559vSecPerClus; j++)				//读取一个簇的数据
		{				
			s = CH559ReadOneSector(DataBuf,secnum+j);   //读取目录项中1个扇区大小
			if(s == ERR_SUCCESS)
			{		
				len = (resvsize>((UINT16)CH559vSectorSizeH<<8))?((UINT16)CH559vSectorSizeH<<8):resvsize;
				IAP_PROM(DataBuf, len);
				resvsize -= len;
#ifdef DEBUG_NOW
				printf("resvsize: x%lx \n",resvsize);
#endif
				if(!resvsize)		return s;			//文件读取完成
			}
		}		
		NextClusNum = CH559ReadDiskFAT(DataBuf,NextClusNum);//计算下一簇号
		
#ifdef DEBUG_NOW
		printf("NextClusNum: x%lx \n",NextClusNum);
#endif
	}while(NextClusNum);
	
	return( s );  /* 磁盘操作错误 */
}


/* ************************************************************************************** */

UINT8	InitRootDevice( void )  // 初始化USB设备
{
	UINT8	i, s, dv_cls, if_cls;
	
#ifdef DEBUG_NOW
	printf( "Reset host port\n" );
#endif
	ResetRootHubPort( );  // 检测到设备后,复位相应端口的USB总线
	for ( i = 0, s = 0; i < 100; i ++ ) {  // 等待USB设备复位后重新连接,100mS超时
		mDelaymS( 1 );
		if ( EnableRootHubPort( ) == ERR_SUCCESS ) {  // 使能端口
			i = 0;
			s ++;  // 计时等待USB设备连接后稳定
			if ( s > 100 ) break;  // 已经稳定连接100mS
		}
	}
	if ( i ) {  // 复位后设备没有连接
		DisableRootHubPort( );
#ifdef DEBUG_NOW
		printf( "Disable host port because of disconnect\n" );
#endif
		return( ERR_USB_DISCON );
	}
	SetUsbSpeed( 1 );  // 设置当前USB速度全速
#ifdef DEBUG_NOW
	printf( "GetDevDescr: " );
#endif
	s = CtrlGetDeviceDescr( );  // 获取设备描述符
	if ( s == ERR_SUCCESS ) {
#ifdef DEBUG_NOW
		for ( i = 0; i < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; i ++ ) printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
		printf( "\n" ); // 显示出描述符
#endif
		
		dv_cls = ( (PXUSB_DEV_DESCR)TxBuffer ) -> bDeviceClass;  // 设备类代码
		s = CtrlSetUsbAddress( ( (PUSB_SETUP_REQ)SetupSetUsbAddr ) -> wValueL );  // 设置USB设备地址
		if ( s == ERR_SUCCESS ) {
#ifdef DEBUG_NOW
			printf( "GetCfgDescr: \n" );
#endif
			s = CtrlGetConfigDescr( );  // 获取配置描述符
			if ( s == ERR_SUCCESS ) {
/* 分析配置描述符,获取端点数据/各端点地址/各端点大小等,更新变量endp_addr和endp_size等 */
				if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceClass;  // 接口类代码
				if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE ) {  // 是USB存储类设备,基本上确认是U盘
					CH559DiskStatus = DISK_USB_ADDR;
					return( ERR_SUCCESS );
				}
				else {
					return( ERR_USB_UNSUPPORT );
				}
			}
		}
	}
#ifdef DEBUG_NOW
	printf( "InitRootDev Err = %02X\n", (UINT16)s );
#endif
	CH559DiskStatus = DISK_CONNECT;
	SetUsbSpeed( 1 );  // 默认为全速
	return( s );
}

void	InitUSB_Host( void )  // 初始化USB主机
{
	IE_USB = 0;					//禁止USB中断

	USB_CTRL = bUC_HOST_MODE;  	// 先设定模式
	USB_DEV_AD = 0x00;			// 连接设备地址为0x00
	
	UHUB1_CTRL &= ~bUH1_DISABLE; //打开HUB1
	UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
	UH_RX_DMA = RxBuffer;
	UH_TX_DMA = TxBuffer;
	UH_RX_CTRL = 0x00;
	UH_TX_CTRL = 0x00;
	
	USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN;  // 启动USB主机及DMA,在中断标志未清除前自动暂停
	UH_SETUP = bUH_SOF_EN;
	USB_INT_FG = 0xFF;  	// 清中断标志
	USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
}

#if 0
/* 检查操作状态,如果错误则显示错误代码并停机 */
void	mStopIfError( UINT8 iError )
{
	if ( iError == ERR_SUCCESS ) return;  /* 操作成功 */
	printf( "Error: %02X\n", (UINT16)iError );  /* 显示错误 */
/* 遇到错误后,应该分析错误码以及CH559DiskStatus状态,例如调用CH559DiskReady查询当前U盘是否连接,如果U盘已断开那么就重新等待U盘插上再操作,
   建议出错后的处理步骤:
   1、调用一次CH559DiskReady,成功则继续操作,例如Open,Read/Write等
   2、如果CH559DiskReady不成功,那么强行将从头开始操作(等待U盘连接，CH559DiskReady等) */
	while ( 1 ) {
//		LED_TMP=0;  /* LED闪烁 */
//		mDelaymS( 100 );
//		LED_TMP=1;
//		mDelaymS( 100 );
	}
}
#endif

#define IAP_CODE_ADDR        (0x7700-1024)	  //1k的整

UINT8	EraseBlock( UINT16 Addr ) 
{
	ROM_ADDR = Addr;
	if ( ROM_STATUS & bROM_ADDR_OK ) {  /* 操作地址有效 */
		if ( (UINT8)EraseBlock & 0x01 ) {
			ROM_CTRL = ROM_CMD_ERASE;
			_nop_( );
		}
		else {
			_nop_( );
			ROM_CTRL = ROM_CMD_ERASE;																				
		}
		return( ( ROM_STATUS ^ bROM_ADDR_OK ) & 0x7F );  /* 返回状态,0x00=success, 0x01=time out(bROM_CMD_TOUT), 0x02=unknown command(bROM_CMD_ERR) */
	}
	else return( 0x40 );
}

