openwch/ch55x/8,CH559 U disk IAP example/CH559_U_IAP/User/ch559_UUP.C
UINT8 ProgWord( UINT16 Addr, UINT16 Data )
{
	ROM_ADDR = Addr;
	ROM_DATA = Data;
	if ( ROM_STATUS & bROM_ADDR_OK ) {  /* 操作地址有效 */
		if ( (UINT8)ProgWord & 0x01 ) {
			ROM_CTRL = ROM_CMD_PROG;
			_nop_( );
		}
		else {
			_nop_( );
			ROM_CTRL = ROM_CMD_PROG;
		}
		return( ( ROM_STATUS ^ bROM_ADDR_OK ) & 0x7F );  /* 返回状态,0x00=success, 0x01=time out(bROM_CMD_TOUT), 0x02=unknown command(bROM_CMD_ERR) */
	}
	else return( 0x40 );
}

void IAP_ERASE(void)
{
	UINT8  s;
	UINT16 i;
	UINT32 addr;
	
	SAFE_MOD = 0x55;
	SAFE_MOD = 0xAA;
	GLOBAL_CFG |= bCODE_WE | bDATA_WE;
	addr = 0x00000000;
	for( i=0; addr <= IAP_CODE_ADDR;i++ ){
		s = EraseBlock( addr );
		addr+=1024;
		if( s != 0 )break;
	}
	SAFE_MOD = 0x55;
	SAFE_MOD = 0xAA;
	GLOBAL_CFG &= ~ ( bCODE_WE | bDATA_WE );
}

void IAP_PROM( PUINT8X DataBuf, UINT16 l )
{
	UINT8  s;
	UINT16 i;
	UINT16 len,Data;
	UINT32 addr;
	
	len = (l+1)>>1;		//必须为2的整数倍，按照半字进行操作
	addr = 0x00000000;
	SAFE_MOD = 0x55;
	SAFE_MOD = 0xAA;
	GLOBAL_CFG |= bCODE_WE | bDATA_WE;
	for( i=0;i!=len;i++ ){							/* 一次写入一个扇区大小 */
		Data = (DataBuf[2*i]| (UINT16)DataBuf[2*i+1]<<8 ); 
		s = ProgWord( addr,Data );
		addr+=2;
		if( s != 0x00 )break;
	}
	SAFE_MOD = 0x55;
	SAFE_MOD = 0xAA;
	GLOBAL_CFG &= ~ ( bCODE_WE | bDATA_WE );
}

void IAP_END(void)
{
	SAFE_MOD = 0x55;					   
	SAFE_MOD = 0xAA;
	GLOBAL_CFG |= bSW_RESET;				/* 复位单片机,进入用户程序 */
}


void main( ) {
	UINT8	s;
	UINT16	i;
  EA = 0;
  ES = 0; 	
  PIN_FUNC &= ~bUART0_PIN_X;                                                 //串口映射到P0.2和P0.3
	mDelaymS(30);                                                              //上电延时,等待内部晶振稳定,必加 
//	CfgFsys();
#ifdef DEBUG_NOW	
	mInitSTDIO(); 
	printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
#endif
	
	InitUSB_Host( );
#ifdef DEBUG_NOW
	printf( "Wait Device In\n" );
#endif

	P4_DIR |= 1<<3;       		// 设置上拉
	P4_OUT |= 1<<3;				// 设置方向输出
	P4_OUT &= ~(1<<3);			// 点亮

	
	while ( 1 ) 
	{
		if(UIF_DETECT)
		{
			UIF_DETECT = 0;
			s = AnalyzeRootHub( );  			    // 分析ROOT-HUB状态;
			if ( s == ERR_USB_CONNECT ) 
			{  										// 有新的USB设备插入
				mDelaymS( 200 );  					// 由于USB设备刚插入尚未稳定,故等待USB设备数百毫秒,消除插拔抖动
				s = InitRootDevice( );  			// 初始化USB设备			
				if ( s == ERR_SUCCESS ) 
				{
/* U盘操作流程：USB总线复位、U盘连接、获取设备描述符和设置USB地址、可选的获取配置描述符，之后到达此处，由CH559子程序库继续完成后续工作 */
					CH559DiskStatus = DISK_USB_ADDR;
					for ( i = 0; i != 10; i ++ ) {
#ifdef DEBUG_NOW
						printf( "Wait DiskReady\n" );
#endif
						s = CtrlGetMaxLUN();
//						if(s == ERR_SUCCESS)
//						{
//							s = CH559ReadDiskInfo(TxBuffer );
							if(s == ERR_SUCCESS)		break;
//						}	
					}
/* 查找文件并获取文件大小 */	
#ifdef DEBUG_NOW
					printf( "DBR \n" );
#endif
					s = CH559ReadDiskDBR(TxBuffer);
#ifdef DEBUG_NOW
					printf( "CHECK \n" );
#endif
					if( s != ERR_SUCCESS) 	IAP_END();
					else					s = CH559FileOpen(TxBuffer);
/* 读取文件内容并下载 */		
#ifdef DEBUG_NOW					
					printf("Read file: %02x\n",(UINT16)s);
#endif
					if(s != ERR_SUCCESS){
#ifdef DEBUG_NOW
						printf("There is no file! \n");
#endif
						IAP_END();						
					}
					else{
						IAP_ERASE()	;								
						s = CH559ReadFile(TxBuffer);		//读取文件内容并下载
						if(s == ERR_SUCCESS){
							P4_OUT |= (1<<3);
							IAP_END();

						}
					}	
				}
				else
				{
#ifdef DEBUG_NOW
					printf("初始化U盘失败，请拔下U盘重试\n");
#endif
				}
			}
		}
	}
}

